import logging
import traceback

__logger = logging.getLogger(__name__)
# flake8: noqa
strings = {
    "ru": {
        "language_applied": "✅ <b>Ваш язык успешно сохранён, изменить вы его сможете в настройках.</b>",
        "enter_login": "✍️ Введите ваш <b>логин</b> от edu.tatar.ru",
        "enter_password": "✍️ Введите ваш <b>пароль</b> от edu.tatar.ru",
        "let_me_check_login_and_password": "⏳ Сейчас проверю данные на правильность, подождите.",
        "incorrect_login_and_password": "🙈 Упс, проверка введённых данных не увенчалась успехом. Может быть два варианта:\n"
        + "- Вы ввели неверную пару логина и пароля;\n"
        + "- Сервера edu.tatar.ru временно не работают.\n"
        + "Если вы уверены, что ваши логин и пароль точно корректны, попробуйте через несколько минут.\n\n"
        + "✍️ Введите ваш <b>логин</b> от edu.tatar.ru:",
        "choose_option": "💁‍♂️ <b>Выберите действие:</b>",
        "daily_grades": "📅 Оценки за день",
        "quarter_grades": "🕒 Оценки за четверть",
        "first_quarter": "1-ая четверть",
        "second_quarter": "2-ая четверть",
        "third_quarter": "3-ая четверть",
        "fourth_quarter": "4-ая четверть",
        "year": "Год",
        "copy": "⬇️ Дублировать️",
        "back": "↩️ Назад",
        "thanks": "Спасибо за регистрацию в боте. ☺️",
        "settings": "⚙️ Настройки",
        "here_you_can_change_settings": "⚙️ В этом разделе вы можете менять настройки бота:",
        "language": "👅 Язык",
        "ru": "Русский",
        "tr": "Татарский",
        "enter_rounding": "✍️ Введите число - правило округления оценок в вашей школе(9&lt;x&lt;100). Пример:\n"
        "<pre>60</pre> - балл округления будет <b>2.60/3.60/4.60</b>",
        "incorrect_rounding": "🙈 Вы ввели <b>неправильное</b> число, нужно вводить как в образце(9&lt;x&lt;100):\n"
        + "<pre>60</pre> для округления в <b>2.60/3.60/4.60</b>",
        "successfully_changed": "✅ Успешно изменено.",
        "rounding_rule": "⏺ Правило округления",
        "are_you_sure": "❓ Вы уверены, что хотите выйти из аккаунта?",
        "yes": "✔️ Да",
        "no": "✖️ Нет",
        "logout": "🚪 Выйти из аккаунта",
        "quarter": "🕒 Четверть",
        "marks": "5️⃣ Оценки",
        "delimeter": "↔️ Ширина разделителя",
        "changeDelimeter": 'ℹ️ Кнопками "+" и "-" уменьшайте и увеличивайте размер разделителя, пока не будет полностью влезать в строку. Это сделано для большего удобства. :)\n',
        "save": "💾 Сохранить",
        "first_halfyear": "1-ое полугодие",
        "second_halfyear": "2-ое полугодие",
    },
    "tr": {
        "language_applied": '✅ <b>Сез Татар телен сайладыгыз. Яңадан телне үзгәртү өчен "Көйләү" бүлегенә керегез. </b>',
        "enter_login": "✍️ edu.tatar.ru сайтына теркәлгән логиныгызны кертегез:",
        "enter_password": "✍️ Логиныгызга туры килгән парольны кертегез:",
        "let_me_check_login_and_password": "⏳ Сез керткән мәгълүматларны тикшерү бара, көтегез.",
        "incorrect_login_and_password": "🙈 Сез керткән мәгълүматлар тикшерүне үтмәде. Моңа ике сәбәп булырга мөмкин:\n"
        + "- пароль логинга туры килми;\n"
        + "- edu.tatar.ru серверлары вакытлыча эшләми.\n"
        + "Логин белән парольның дөреслеген тикшерегез, булмаса, серверга соңрак мөрәҗәгать итегез.\n\n"
        + "✍️ edu.tatar.ru сайтына теркәлгән логиныгызны кертегез:",
        "choose_option": "💁‍♂️ <b>Кызыксындырган бүлекне сайлагыз:</b>",
        "daily_grades": "📅 Көндәлек билгеләр",
        "quarter_grades": "🕒 Чирек билгеләре",
        "first_quarter": "1-нче чирек",
        "second_quarter": "2-нче чирек",
        "third_quarter": "3-нче чирек",
        "fourth_quarter": "4-нче чирек",
        "year": "Ел",
        "copy": "⬇ Күчермә",
        "back": "↩ Кире кайту",
        "thanks": "Регистрация өчен рәхмәтебезне белдерәбез. ☺️",
        "settings": "⚙️ Көйләү бүлеге",
        "here_you_can_change_settings": "⚙ Бу бүлектә Сез Бот көйләүләрен үзгәртә аласыз:",
        "language": "👅 Тел",
        "ru": "Рус теле",
        "tr": "Татар теле",
        "enter_rounding": "✍️ Сезнең мәктәптә  кабул ителгән билге түгәрәкләү кагыйдәсен сайлагыз - сан кертегез(9&lt;x&lt;100). Мәсәлән:\n"
        "<pre>60</pre> - түгәрәкләү саны <b>2.60/3.60/4.60</b>",
        "incorrect_rounding": "🙈 Сез дөрес сан кертмәдегез,  үрнәк буенча сан кертегез(9&lt;x&lt;100):\n"
        + "<pre>60</pre> түгәрәкләү өчен <b>2.60/3.60/4.60</b>",
        "successfully_changed": "✅ Үзгәреш кабул ителде.",
        "rounding_rule": "⏺ Түгәрәкләү кагыйдәсе",
        "are_you_sure": "❓ Сез акаунттан чыгасыз, ниятегезне дөрес аңлыйбыз мы?",
        "yes": "✔️ Әйе",
        "no": "✖️ Юк",
        "logout": "🚪 Аккаунттан чыгу",
        "quarter": "🕒 Чирек",
        "marks": "5️⃣ Билге",
        "delimeter": "↔️ Аеру билгесенең киңлеге",
        "changeDelimeter": "ℹ️ Аеру билгесен экран киңлегенә туры китерер өчен  "
        + ' яки "-" тамгаларына басыгыз. Бу мөмкинлек сезнең уңайлык өчен ясалган.',
        "save": "💾 Саклау",
        "first_halfyear": "1-ое ярты еллык",
        "second_halfyear": "2-ое ярты еллык",
    },
}


def get_text(language, string):
    __logger.debug(
        "ASKED FOR STRING: {}, LANGUAGE: {}".format(string, language)
    )
    try:
        return strings[language][string]
    except KeyError as e:
        traceback.print_exc()
        return ""
